import string

# Доступные алфавиты
ALPHABETS = {
    "standard": (
        string.ascii_letters
        + "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
        + string.digits
        + string.punctuation
        + " "
    ),
    "matrix": "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz日ﾊﾐﾋｰｳｼﾅﾓﾆｻﾜﾂｵﾘｱﾎﾏｹﾒｴｶｷﾑﾕﾗｾﾈｽﾀﾇﾍｦｲｸｺｿﾁﾄﾉﾌﾔﾖﾙﾚﾛﾝ",
    "binary": "01 ",
    "hex": "0123456789ABCDEF ",
    "cyber": "☠☣☢⚠⚡⚧⚪⚫🔴🔵🔸🔹"
}

# ANSI Цвета
COLORS = {
    "RESET": "\033[0m",
    "BOLD": "\033[1m",
    "GREEN": "\033[38;5;46m",
    "CYAN": "\033[38;5;51m",
    "RED": "\033[38;5;196m",
    "YELLOW": "\033[38;5;226m",
    "MAGENTA": "\033[38;5;201m",
    "BLUE": "\033[38;5;21m",
    "WHITE": "\033[38;5;231m",
    "ORANGE": "\033[38;5;208m",
}

# Темы для градиентов (RGB)
GRADIENTS = {
    "fire": [(255, 0, 0), (255, 128, 0), (255, 255, 0)],
    "ice": [(0, 255, 255), (0, 128, 255), (0, 0, 255)],
    "matrix": [(0, 50, 0), (0, 255, 0), (200, 255, 200)],
    "rainbow": [(255, 0, 0), (255, 255, 0), (0, 255, 0), (0, 255, 255), (0, 0, 255), (255, 0, 255)],
    "neon": [(255, 0, 128), (128, 0, 255), (0, 255, 255)]
}
